Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_team.this["js-libp2p ChainSafe Maintainers"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "js-libp2p ChainSafe Maintainers"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["js-libp2p ChainSafe Maintainers → mpetrunic"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "mpetrunic"
    }

  # github_team_membership.this["js-libp2p ChainSafe Maintainers → wemeetagain"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "wemeetagain"
    }

  # github_team_repository.this["js-libp2p ChainSafe Maintainers → js-libp2p"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-libp2p"
      + team_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ team            = [
        # (6 unchanged elements hidden)
        {
            id    = 5253535
            index = "go-libp2p Maintainers"
        },
      - {
          - id    = 3152313
          - index = "infra"
        },
        {
            id    = 3891830
            index = "Observation UI"
        },
        # (9 unchanged elements hidden)
    ]
  ~ team_membership = [
        # (67 unchanged elements hidden)
        {
            id    = "5253535:adlrocha"
            index = "go-libp2p Maintainers → adlrocha"
        },
      - {
          - id    = "3152313:stongo"
          - index = "infra → stongo"
        },
        {
            id    = "3891830:raulk"
            index = "Observation UI → raulk"
        },
        # (96 unchanged elements hidden)
    ]
  ~ team_repository = [
        # (221 unchanged elements hidden)
        {
            id    = "5253535:go-libp2p-backoff"
            index = "go-libp2p Maintainers → go-libp2p-backoff"
        },
      - {
          - id    = "3152313:dht-tracer"
          - index = "infra → dht-tracer"
        },
        {
            id    = "3891830:observer-toolkit"
            index = "Observation UI → observer-toolkit"
        },
        # (293 unchanged elements hidden)
    ]
```

</details>
<!-- Sticky Pull Request Comment -->